package ru.geekbrains.JavaCore2.lesson2;

public final class TestArray {
    // правильный массив
    static String testArray1[][] = {
            {"1", "2", "3", "4"},
            {"3434", "4545", "5656", "7878"},
            {"-36236", "-5353", "-7677", "-2323"},
            {"1", "2", "3", "0"}
    };

    // неверный размер строк
    static String testArray2[][] = {
            {"1", "2", "3", "4"},
            {"3434", "4545", "5656", "7878"},
            {"-36236", "-5353", "-7677", "-2323"},
            {"1", "2", "3", "dfsdfsdfsdf"},
            {"1", "2", "3", "4"},
    };

    // неверный размер столбцов
    static String testArray3[][] = {
            {"1", "2", "3", "4", "5"},
            {"3434", "4545", "5656", "7878"},
            {"-36236", "-5353", "-7677", "-2323"},
            {"1", "2", "3", "dfsdfsdfsdf"}
    };

    // не число
    static String testArray4[][] = {
            {"1", "2", "3", "4"},
            {"3434", "4545", "5656", "7878"},
            {"-36236", "-5353", "-7677", "-2323"},
            {"1", "2", "3", "dfsdfsdfsdf"}
    };

}
